Assignment Instructions:

1.Design a relational database for an education system, which fulfils the following requirements:

* Information of departments, programs, students, teachers and courses are stored in the databases.
* The relationships of departments, programs, students, teachers and courses are stored in the databases.
* Departments provide different programs. Each program belongs to one department.
* Each course has at least one teacher. It is possible that one course has two or more teachers. And each course is hosted by one department.
* Each teacher belongs to one department.
* Each program has several courses. It is possible that one course is shared by two or more different programs.
* Each student belongs to one program.
* At one semester, students can choose different courses which belong to their programs.
* There are mandatory and elective courses. It is possible for a student to choose elective courses from other programs.
* Each course has its own credits.
* There is a maximam limit of total credits that students can get in one semester. This means there is a limit of number of courses one student can chose at each semester.
* Some courses have pre-course requirements. And some courses cannot be chosen at the same time.
* Design queries that are useful for teachers, students, student adminitrators. For example, how many credits a student has obtained? how many are mandatory credits? How many more mandatory/elective credits s/he has to obtain to graduate?

2.To design a databse step by step, read this [Quick-Start Tutorial on Relational Database Design](https://www.ntu.edu.sg/home/ehchua/programming/sql/Relational_Database_Design.html).
 

3.Create tables based on your design for this education system in the provided empty SQLite database "empty_db.db". For each table, the description of table and the corresponding create sql need to be listed in the notebook. One simple example has been given.

* Rename the db file as ""
* Command for "show tables" with ipython-sql: "%sql SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;"
* Command for "describe tables" with ipython-sql: "%sql PRAGMA table_info(Table_Name);"
* If working with a shell or DOS prompt, Sqlite also provides command ".tables" and ".schema Table_Name".
* More information on Sqlite can be found at [Sqlite Quick Start](https://sqlite.org/quickstart.html)

In [2]:
%load_ext sql

C:\Users\olavt\Anaconda3\lib\site-packages\IPython\config.py:13: ShimWarning: The `IPython.config` package has been deprecated since IPython 4.0. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
C:\Users\olavt\Anaconda3\lib\site-packages\IPython\utils\traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

(sqlite3.OperationalError) near "DATABASE": syntax error [SQL: 'DROP DATABASE :///A3database.db']

Example:

Table: student

Description: Information of students are stored in this table, such as name and email.

In [3]:
%sql sqlite:///A3database.db

'Connected: None@A3database.db'

In [4]:
%%sql 
CREATE TABLE department (
    dID int,
    name varchar(255),
    PRIMARY KEY(dID)
);

Done.

[]

In [5]:
%sql PRAGMA table_info(department)

Done.

[(0, 'dID', 'int', 0, None, 1), (1, 'name', 'varchar(255)', 0, None, 0)]

In [6]:
%%sql 
CREATE TABLE course (
    cID int,
    name varchar(255),
    credit int,
    mandatory bool,
    elective bool,
    PRIMARY KEY(cID)
);

Done.

[]

In [7]:
%sql PRAGMA table_info(course)

Done.

[(0, 'cID', 'int', 0, None, 1),
 (1, 'name', 'varchar(255)', 0, None, 0),
 (2, 'credit', 'int', 0, None, 0),
 (3, 'mandatory', 'bool', 0, None, 0),
 (4, 'elective', 'bool', 0, None, 0)]

In [10]:
%%sql 
CREATE TABLE program (
    pID int,
    name varchar(255),
    dID int,
    PRIMARY KEY(pID),
    FOREIGN KEY (dID) REFERENCES department(dID)
);

Done.

[]

In [11]:
%sql PRAGMA table_info(program)

Done.

[(0, 'pID', 'int', 0, None, 1),
 (1, 'name', 'varchar(255)', 0, None, 0),
 (2, 'dID', 'int', 0, None, 0)]

In [12]:
%%sql 
CREATE TABLE student (
    sID int,
    first_name varchar(255),
    last_name varchar(255),
    email varchar(255),
    credits int,
    pID int,
    PRIMARY KEY(sID),
    FOREIGN KEY (pID) REFERENCES program(pID)
);

Done.

[]

In [13]:
%sql PRAGMA table_info(student)

Done.

[(0, 'sID', 'int', 0, None, 1),
 (1, 'first_name', 'varchar(255)', 0, None, 0),
 (2, 'last_name', 'varchar(255)', 0, None, 0),
 (3, 'email', 'varchar(255)', 0, None, 0),
 (4, 'credits', 'int', 0, None, 0),
 (5, 'pID', 'int', 0, None, 0)]

In [14]:
%%sql 
CREATE TABLE teacher (
    tID int,
    first_name varchar(255),
    last_name varchar(255),
    email varchar(255),
    dID int,
    PRIMARY KEY(tID),
    FOREIGN KEY (dID) REFERENCES department (dID)
);

Done.

[]

In [15]:
%sql PRAGMA table_info(teacher)

Done.

[(0, 'tID', 'int', 0, None, 1),
 (1, 'first_name', 'varchar(255)', 0, None, 0),
 (2, 'last_name', 'varchar(255)', 0, None, 0),
 (3, 'email', 'varchar(255)', 0, None, 0),
 (4, 'dID', 'int', 0, None, 0)]

Making the relationstables

In [ ]:
%%sql 
CREATE TABLE enrollment (
    sID int,
    cID int,
    PRIMARY KEY(sID, cID)
);